package com.weibo.hotspot.bean;

import java.util.Arrays;
import java.util.List;

public class Emoticon
{

    /** 无效的特殊字符 */
    private static String[] SPECIALCHARACTERS =
    {
     "[耶]"  ,"[顶]"   ,"[怒]"  ,"[晕]"  ,"[色]","[泪]","[弱]","[衰]","[哼]",
     "[心]", "[钟]", "[酷]",  
            
     "[星星]","[鲜花]","[太阳]","[飞机]","[月亮]","[落叶]",
     "[蛋糕]","[蜡烛]",
     "[喵喵]",
     "[拜拜]","[浮云]",
     "[感冒]","[生病]",
     "[互粉]","[馋嘴]","[挤眼]","[呲牙]",
     "[许愿]","[半星]",
     "[打脸]","[神马]","[阴险]",
     "[爱你]","[害羞]","[可爱]","[好棒]","[亲亲]","[鼓掌]",
     "[微笑]","[偷笑]","[嘻嘻]","[哈哈]","[呵呵]",
     "[思考]","[拳头]","[围观]","[威武]",
     "[失望]","[尴尬]","[纠结]","[悲催]","[悲伤]","[伤心]",
     "[吃惊]","[得意]",
     
     "[好喜欢]","[抠鼻屎]","[抢到啦]","[草泥马]","[笑哈哈]","[右哼哼]","[左哼哼]",
     "[奥特曼]",
     "[发红包啦]","[抢到啦]","[好爱哦]",
     "[不好意思]","[泪流满面]",
     "[笑cry]","[doge]","[haha]","[good]",
     
     "[大雄微笑]",
     "[芒果萌萌哒]",
     "[哆啦A梦微笑]","[哆啦A梦花心]","[哆啦A梦吃惊]",
     
     "[挖鼻]", "[下雨]", "[微风]", "[黑线]", "[来]",
     "[污]", "[摊手]", "[猪头]", "[男孩儿]", "[女孩儿]", 
     "[二哈]", "[舔屏]", "[太开心]", "[哆啦A梦汗]", "[噢耶]", 
     "[坏笑]", "[傻眼]", "[音乐]", "[电影]", "[玫瑰]", "[汗]",
     "[兔子]", "[白眼]", "[胜利]", "[得意地笑]", "[雷锋]", "[怒骂]",
     "[带着微博去旅行]", "[作揖]", "[给劲]", "[哈欠]", "[甩甩手]",
     "[话筒]", "[给力]", "[你的宫铃]", "[礼物]", "[愉快]", "[花心]", 
     "[可怜]", "[惊讶]", "[大红灯笼]", "[喜]", "[炸鸡和啤酒]", "[调皮]",
     "[马上有对象]", "[抓狂]", "[干杯]", "[赞啊]", "[挖鼻屎]", "[沙尘暴]", 
     "[熊猫]", "[温暖帽子]", "[同意]", "[咖啡]", "[实习]", "[ali郁闷]", 
     "[lxhx顺毛]",  "[悲傷]",
     "[困死了]", "[肥皂]", "[X教授]", "[广告]", "[做鬼脸]", "[委屈]",
     "[囧]",  "[蠟燭]", "[打哈气]", "[好囧]", "[憨笑]",
     "[国庆65周年]", "[照相机]", "[雪花]", "[懒得理你]", "[自行车]", 
     "[瞧瞧]", "[推荐]", "[睡]", "[拥抱]", "[求关注]", "[羞嗒嗒]", 
     "[互相膜拜]", "[赞]", "[偷乐]", "[书呆子]", "[崩溃]", "[hold住]",
     "[钱]", "[爱心传递]", "[花]", "[疑问]", "[勾引]", "[江南style]", 
     "[转发]", "[绿丝带]", "[困]", "[鄙视]", "[嘘]", "[糖宝惊呆了]", 
     "[睡觉]", "[发红包]", "[汽车]", "[流泪]", "[大哭]", "[羊年大吉]",
     "[丘比特]", "[围脖]", "[马到成功]", "[杰克逊]", "[吐]", "[震惊]", 
     "[别烦我]", "[闭嘴]", "[拍照]", "[甜馨得瑟]", "[不要]", "[强]", 
     "[爱爱爱]", "[握手]", "[被电]", "[巨汗]", "[伦敦奥火]", "[雪]", 
     "[擦汗]", "[手套]", "[想一想]", "[愤怒]", "[萌]", "[奋斗]", "[浪]",
     "[地点]", "[lt切克闹]", "[爱你心情很[汽车]", "[织]", "[km唠叨]", 
     "[拜拜]", "[七夕快乐]", "[群体围观]", "[陆毅]", "[新年快乐]",
     "[霹雳]", "[悠闲]", "[惊恐]", "[吓]", "[NO]", "[em]", "[/em]", 
     "[骷髅]", "[OK]", "[三讲公司]", "[手机]", "[ali嘘嘘嘘]", "[吃元宵]",
     "[彩虹]", "[凋谢]", "[嘴唇]", "[羞羞哒甜馨]", "[/cp]", "[xkl转圈]",
     "[撇嘴]", "[最右]", "[再见]", "[小骨最萌了]", "[萌娃大竣]", "[喝多了]",
     "[加油啊]", "[ali抱枕]", "[足球]", "[冰棍]", "[到店送]", "[去旅行]",
     "[ok]", "[鲜花]", "[熊貓]", "[爱心]", "[哭哭]", "[爱红包]", "[Laugh]",
     "[甜馨尴尬]", "[/抠鼻]", "[兔兔]", "[快哭了]", "[cc偷乐]", "[闪]", 
     "[抱拳]", "[织女]", "[雪人]", "[甜馨翻白眼]", "[cc嘿嘿]", "[甜馨热热]", 
     "[yz扇扇子]", "[yz来看看]", "[抱抱]", "[加油]", "[快银]", "[跳跳]", 
     "[转圈]", "[轉發]", "[图书]", "[淚流滿面]", "[許願]", "[吃驚]",
     "[心碎]", "[lt黑线]", "[跳舞]", "[g魅眼]", "[飛機]", "[平安果]", 
     "[康康保佑]", "[lxhx听歌]", "[打针]", "[萌神奥莉]", "[闪电]", 
     "[攤手]", "[真心英雄朱亚文]", "[太陽]", "[发呆]", "[敲打]", 
     "[奥运金牌]", "[西瓜]", "[cc郁闷]", "[有鸭梨]", "[牛郎]", 
     "[躁狂症]", "[糗大了]", "[冷汗]", "[红丝带]", "[夏天公主]", 
     "[风扇]", "[啤酒炸鸡]", "[炸鸡啤酒]", "[傲慢]", "[咒骂]",
     "[饞嘴]", "[林老师萌萌哒]", "[/可爱]", "[捂嘴笑]", 
     "[bofu暴躁]", "[射手]", "[奥运银牌]", "[奥运铜牌]", 
     "[痴情轩轩]", "[gbz祈福了]",
     "[不想上班]", "[/爱心]", "[流汗]", "[bofu票子快来]", "[投降]", "[爱情]",
     "[发怒]", "[呲牙[甩甩手]", 
     "[帅]", "[打哈欠]", "[疯了]","[飞吻]", "[抠鼻]", "[瓢虫]", "[歪果仁夏克立]",
     "[牡丹亭]", "[阳光]", "[暈]", "[淚]", "[真心英雄郑元畅]", "[愛你]", 
     "[可愛]", "[微風]", "[別煩我]", "[中箭]", "[尊上么么哒]", 
     "[让小编文艺一次]", "[难过]", "[求抱抱]", "[千骨花]",
     "[可爱霓娜]", "[圣诞快乐]",
     "[甜馨哭哭]", "[甜馨吃货]", "[心圆]", "[真心英雄佟大为]", 
     "[甜馨颜值高]", "[toto数落]", "[b]", "[翻白眼]", "[擠眼]",
     "[这个坐标淮大是什么]", "[随便披萨]", "[我想静静]", 
     "[/跳跳]", "[/抱拳]", "[/玫瑰]", "[裹紧衣服在风中发抖]", 
     "[[汗]", "[诺一粗来嗨]",   "[德国队加油]", "[极简主义]",
     "[cc蒙面]", "[真V5]", "[親親]", "[路过这儿]", "[g发飘]", 
     "[c亲亲]", "[km挖鼻屎]", "[最美杀阡陌]", "[傑克遜]",
     "[dino礼物]", "[ali翻白眼]", "[lm爱爱爱]", "[我爱西瓜]", 
     "[/可怜]", "[神馬]", "[菜刀]", "[刀]", "[嗯]", "[真心英雄张杰]",
     "[/冷汗]", "[摳鼻屎]", "[鞭炮]", "[gst耐你]", "[适用对象]", 
     "[酒]", "[ali溜]", "[orz]", "[爱你哟]", "[摸头]", "[g扇笑]", 
     "[g无辜]", "[強]", "[yz好哇]", "[啤酒]", "[圣诞老人]", "[c委屈]",
     "[c得瑟]", "[i]",  "[冰川时代希德奶奶]", "[冰川时代希拉]",
     "[moc转发]", "[ppb鼓掌]", "[哎呦熊鼓掌]", "[亲一口]", "[nono跳舞]",
     "[自习室女生周子琰(下课时间)]", "[din推撞]", "[閉嘴]", "[dx洗澡]",
     "[km黑块不淡定]", "[麻辣]", "[跳绳]", "[怒罵]", "[骑行山东青岛]",
      "[哆啦A夢花心]", "[ali拜年]", "[用起芭瑞雅]", "[老公早回家]", 
      "[nono摇手指]", "[dx抛媚眼]", "[km亲亲黑块]", "[叶子]",
      "[爆发]", "[中国好声音]", "[经典-普通]", "[手纸]", 
      "[bofu给力]", "[回头]", "[cc祈祷]", "[萌萌扭屁股]",
      "[问号]", "[lt囧]", "[美味]", "[km亲亲]", 
      "[饭]", "[給力]", "[拳王邹市明]", "[做鬼臉]",
      "[km高兴]", "[yz好紧张]", "[bm可爱]", "[c发火]", "[转]", 
      "[悼念乔布斯]", "[弟弟皓皓]", "[lxhx刷牙]", "[bobo抛媚眼]", 
      "[晚安——微博]", "[扔鸡蛋]", "[g裸奔1]", "[炸弹]", "[/呲牙]", 
      "[ali甩手]", "[创新之路]", "[阿根廷队加油]", "[怄火]", "[勝利]",
      "[求宝宝心里阴影面积]", "[小公主珊珊]", 
      "[拼音:吱嗷儿 ]", "[巴西队加油]", "[最差]", "[lxhx泪目]",
      "[疯子的自述]", "[km酷2]", "[moc装酷]", "[起亚律动]", "[好喜歡]",
      "[dino坏笑]", "[dino打滚]", "[生病鸟]", "[拳頭]", "[看涨]",
      "[c关注]", "[dx滑板]", "[小便屁]", "[ppb杀啊]",
      "[/微笑]", "[冰桶挑战]", "[c看热闹]", "[怒吼]", 
      "[蓝莓酸奶条]", "[星星眼儿]", "[笑]", "[宠爱]", "[无语]",
      "[kxl晕]", "[女孩]", "[父亲节]", "[鸡冻!]", "[得瑟]", 
      "[酷库熊亲亲]", "[伸舌头]",   "[水瓶座]", "[好愛哦]", "[草泥馬]", 
      "[傷心]", "[c左右看]", "[累癱倒在床上]", "[鸭梨很大]", 
      "[膜拜]", "[月亮]", "[[睡]", "[黑線]", "[bed挠痒]", "[ala耶]", 
      "[km问号]", "[真心英雄陈学冬]", "[紧张]", "[lxhx掀桌]",
      "[萌萌敲鼓]", "[豬頭]", "[钢琴]", "[银牌]", "[鮮花]", 
      "[嘴唇 ]", "[浮雲]", "[cc晕菜]", "[希德奶奶]", "[/em]", 
      "[益生菌科普]", "[看惯背影]", "[强烈挽留]", "[早安心语]"
    };
    
    
    
    private static  List<String> Emoticon = Arrays.asList(SPECIALCHARACTERS);

    public static List<String> getEmoticon()
    {
        return Emoticon;
    }

    public static void setEmoticon(List<String> emoticon)
    {
        Emoticon = emoticon;
    }

    

}
